app/controllers/notes_controller.rb

  def index
    @notes = Note.where(username: 'demo')
---
SELECT "notes".* FROM "notes" WHERE "notes"."username" = ?  [["username", "demo"]]

  def create
    @note = Note.create(note_params)
---
INSERT INTO "notes" ("notetitle", "username", "created_at", "updated_at", "notetext") VALUES (?, ?, ?, ?, ?)  [["notetitle", "test"], ["username", "demo"], ["created_at", "2019-04-29 15:24:00.613042"], ["updated_at", "2019-04-29 15:24:00.613042"], ["notetext", "test234"]]