app/controllers/pages_controller.rb

    def edit_sticky
        @notes = Note.all
---
SELECT "notes".* FROM "notes"