app/controllers/users_controller.rb

INSERT INTO "users" ("username", "datecreated", "password", "phonenumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "test"], ["datecreated", "2019-04-01"], ["password", "test"], ["phonenumber", "1"], ["created_at", "2019-04-01 16:43:34.724377"], ["updated_at", "2019-04-01 16:43:34.724377"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save